badgeteam/hackerhotel-2024-firmware-esp32c6/components/hackerhotel2024-bsp/bsp.c
#include "bsp.h"
#include "ch32.h"
#include "driver/gpio.h"
#include "driver/i2c.h"
#include "driver/sdmmc_defs.h"
#include "driver/sdspi_host.h"
#include "driver/spi_master.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_log.h"
#include "esp_ota_ops.h"
#include "esp_vfs_fat.h"
#include "freertos/FreeRTOS.h"
#include "freertos/portmacro.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "ledstrip.h"
#include "managed_i2c.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "pax_codecs.h"
#include "pax_gfx.h"
#include "sdmmc_cmd.h"
#include <string.h>

const uint8_t target_coprocessor_fw_version = 4;  // Must match the value in the ch32_firmware.bin resource

static const char* TAG = "bsp";

static hink_t epaper = {
    .spi_bus               = SPI_BUS,
    .pin_cs                = GPIO_EPAPER_CS,
    .pin_dcx               = GPIO_EPAPER_DCX,
    .pin_reset             = GPIO_EPAPER_RESET,
    .pin_busy              = GPIO_EPAPER_BUSY,
    .spi_speed             = EPAPER_SPEED,
    .spi_max_transfer_size = SOC_SPI_MAXIMUM_BUFFER_SIZE,
    .screen_width          = EPAPER_WIDTH,
    .screen_height         = EPAPER_HEIGHT,
};

static ledstrip_t ledstrip = {
    .pin = GPIO_LED_DATA,
};

static ledstrip_t sao_ledstrip = {
    .pin = GPIO_SAO_IO1,
};

static sdmmc_card_t* card = NULL;

static uint16_t coprocessor_fw_version = 0;

static bool bsp_ready      = false;
static bool ch32v003_ready = false;
static bool epaper_ready   = false;

static adc_oneshot_unit_handle_t adc_vbatt_handle = NULL;

static pax_buf_t pax_buffer;
static pax_col_t palette[] = {0xffffffff, 0xff000000, 0xffff0000};  // white, black, red

typedef void (*coprocessor_intr_t)();

static SemaphoreHandle_t coprocessor_intr_trigger     = NULL;
static TaskHandle_t      coprocessor_intr_task_handle = NULL;
static QueueHandle_t     coprocessor_button_queue     = NULL;
static SemaphoreHandle_t coprocessor_semaphore        = NULL;

extern const uint8_t ch32_firmware_start[] asm("_binary_ch32_firmware_bin_start");
extern const uint8_t ch32_firmware_end[] asm("_binary_ch32_firmware_bin_end");

extern const uint8_t hackerhotel_png_start[] asm("_binary_hackerhotel_png_start");
extern const uint8_t hackerhotel_png_end[] asm("_binary_hackerhotel_png_end");

esp_err_t bsp_display_error(const char* error) {
    ESP_LOGE(TAG, "%s", error);
    if (epaper_ready) {
        const pax_font_t* font = pax_font_sky_mono;
        pax_background(&pax_buffer, WHITE);
        pax_draw_text(&pax_buffer, RED, font, 18, 5, 5, "Error");
        pax_draw_text(&pax_buffer, BLACK, font, 12, 5, 25, error);
        bsp_display_flush();
    }
    return ESP_OK;
}

esp_err_t bsp_display_message(const char* title, const char* message) {
    ESP_LOGI(TAG, "%s", message);
    if (epaper_ready) {
        const pax_font_t* font = pax_font_sky_mono;
        pax_background(&pax_buffer, WHITE);
        pax_draw_text(&pax_buffer, RED, font, 18, 0, 0, title);
        pax_draw_text(&pax_buffer, BLACK, font, 12, 0, 25, message);
        bsp_display_flush();
    }
    return ESP_OK;
}

static esp_err_t flash_coprocessor() {
    bool res;

    ch32_init(GPIO_CH32_SWD);
    ch32_sdi_reset();
    ch32_enable_slave_output();

    res = ch32_check_link();
    if (!res) {
        ESP_LOGE(TAG, "CH32V003 link check failed");
        return ESP_FAIL;
    }

    res = ch32_halt_microprocessor();
    if (!res) {
        ESP_LOGE(TAG, "CH32V003 failed to halt microcontroller");
        return ESP_FAIL;
    }

    ch32_unlock_flash();
    ch32_set_nrst_mode(false);  // Use NRST as GPIO

    res = ch32_write_flash(0x08000000, ch32_firmware_start, ch32_firmware_end - ch32_firmware_start);
    if (!res) {
        return ESP_FAIL;
    }

    res = ch32_reset_microprocessor_and_run();
    if (!res) {
        ESP_LOGE(TAG, "CH32V003 failed to reset and run");
        return ESP_FAIL;
    }

    return ESP_OK;
}

static void IRAM_ATTR coprocessor_intr_handler(void* arg) {
    /* in interrupt handler context */
    xSemaphoreGiveFromISR(coprocessor_intr_trigger, NULL);
    portYIELD_FROM_ISR();
}

static void coprocessor_intr_task(void* arg) {
    uint8_t prev_buttons[5] = {0};

    while (1) {
        if (xSemaphoreTake(coprocessor_intr_trigger, portMAX_DELAY)) {
            if (xSemaphoreTake(coprocessor_semaphore, portMAX_DELAY)) {
                uint8_t   buttons[5];
                esp_err_t res = i2c_read_reg(I2C_BUS, COPROCESSOR_ADDR, COPROCESSOR_REG_BTN, buttons, 5);
                xSemaphoreGive(coprocessor_semaphore);
                if (res != ESP_OK) {
                    ESP_LOGE(TAG, "Coprocessor interrupt task failed to read button states");
                    continue;
                }
                for (uint8_t index = 0; index < sizeof(buttons); index++) {
                    if (prev_buttons[index] != buttons[index]) {
                        prev_buttons[index] = buttons[index];
                        // ESP_LOGD(TAG, "Button state changed: %u = %u", index, buttons[index]);
                        coprocessor_input_message_t message;
                        message.button = index;
                        message.state  = buttons[index];
                        xQueueSend(coprocessor_button_queue, &message, 0);
                    }
                }
            }
        }
    }
}

static esp_err_t initialize_led() {
    esp_err_t res = ledstrip_init(&ledstrip);
    if (res != ESP_OK) {
        return res;
    }
    const uint8_t data[3] = {0, 0, 0};
    res                   = ledstrip_send(&ledstrip, data, 3);
    return res;
}

static esp_err_t initialize_nvs() {
    esp_err_t res = nvs_flash_init();
    if (res == ESP_ERR_NVS_NO_FREE_PAGES || res == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        res = nvs_flash_erase();
        if (res != ESP_OK)
            return res;
        res = nvs_flash_init();
    }
    return res;
}

static esp_err_t initialize_gpio() {
    // Interrupt service
    esp_err_t res = gpio_install_isr_service(0);
    if (res != ESP_OK) {
        return res;
    }

