badgeteam/hackerhotel-2024-firmware-esp32c6/components/hackerhotel2024-bsp/bsp.c
    // Relay
    gpio_config_t relay_cfg = {
        .pin_bit_mask = BIT64(GPIO_RELAY),
        .mode         = GPIO_MODE_OUTPUT,
        .pull_up_en   = false,
        .pull_down_en = false,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    res = gpio_config(&relay_cfg);
    if (res != ESP_OK) {
        return res;
    }

    res = gpio_set_level(GPIO_RELAY, false);
    if (res != ESP_OK) {
        return res;
    }

    // SAO
    gpio_config_t sao_cfg = {
        .pin_bit_mask = BIT64(GPIO_SAO_IO1) | BIT64(GPIO_SAO_IO2),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = false,
        .pull_down_en = false,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    res = gpio_config(&sao_cfg);
    if (res != ESP_OK) {
        return res;
    }

    // Battery
    gpio_config_t battery_cfg = {
        .pin_bit_mask = BIT64(GPIO_BATT_CHRG) | BIT64(GPIO_BATT_ADC),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = false,
        .pull_down_en = false,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    res = gpio_config(&battery_cfg);
    if (res != ESP_OK) {
        return res;
    }

    adc_oneshot_unit_init_cfg_t init_config1 = {
        .unit_id = ADC_UNIT_1,
    };
    res = adc_oneshot_new_unit(&init_config1, &adc_vbatt_handle);
    if (res != ESP_OK) {
        return res;
    }

    adc_oneshot_chan_cfg_t config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten    = ATTEN_VBATT,
    };
    res = adc_oneshot_config_channel(adc_vbatt_handle, ADC_VBATT, &config);
    if (res != ESP_OK) {
        return res;
    }

    return ESP_OK;
}

static esp_err_t initialize_epaper_lut() {
    esp_err_t res = ESP_OK;

    if (!hink_get_lut_populated()) {
        ESP_LOGW(TAG, "Epaper LUT table not initialized");
        res = hink_read_lut(
            GPIO_SPI_MOSI,
            GPIO_SPI_CLK,
            epaper.pin_cs,
            epaper.pin_dcx,
            epaper.pin_reset,
            epaper.pin_busy
        );
        if (res != ESP_OK) {
            return res;
        }
    }

    return res;
}

static esp_err_t initialize_spi_bus() {
    spi_bus_config_t busConfiguration = {0};
    busConfiguration.mosi_io_num      = GPIO_SPI_MOSI;
    busConfiguration.miso_io_num      = GPIO_SPI_MISO;
    busConfiguration.sclk_io_num      = GPIO_SPI_CLK;
    busConfiguration.quadwp_io_num    = -1;
    busConfiguration.quadhd_io_num    = -1;
    busConfiguration.max_transfer_sz  = SOC_SPI_MAXIMUM_BUFFER_SIZE;
    return spi_bus_initialize(SPI2_HOST, &busConfiguration, SPI_DMA_CH_AUTO);
}

static esp_err_t initialize_epaper() {
    esp_err_t res = hink_init(&epaper);
    if (res != ESP_OK) {
        return res;
    }
    res = hink_apply_lut(&epaper, lut_1s);
    if (res != ESP_OK) {
        return res;
    }
    return res;
}

static esp_err_t initialize_graphics() {
    pax_buf_init(&pax_buffer, NULL, epaper.screen_width, epaper.screen_height, PAX_BUF_2_PAL);
    pax_buf_set_orientation(&pax_buffer, PAX_O_ROT_CCW);
    pax_buffer.palette      = palette;
    pax_buffer.palette_size = sizeof(palette) / sizeof(pax_col_t);
    return ESP_OK;
}

static esp_err_t initialize_i2c_bus() {
    esp_err_t res;

    i2c_config_t i2c_config = {
        .mode             = I2C_MODE_MASTER,
        .sda_io_num       = GPIO_I2C_SDA,
        .scl_io_num       = GPIO_I2C_SCL,
        .master.clk_speed = I2C_SPEED,
        .sda_pullup_en    = false,
        .scl_pullup_en    = false,
        .clk_flags        = 0,
    };

    res = i2c_param_config(I2C_BUS, &i2c_config);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Configuring I2C bus parameters failed");
        return res;
    }

    res = i2c_driver_install(I2C_BUS, i2c_config.mode, 0, 0, 0);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Initializing I2C bus failed");
        return res;
    }

    return ESP_OK;
}

esp_err_t initialize_coprocessor() {
    bool invalid_version = false;

    coprocessor_fw_version = 0;
    esp_err_t res          = i2c_read_reg(
        I2C_BUS,
        COPROCESSOR_ADDR,
        COPROCESSOR_REG_FW_VERSION,
        (uint8_t*)&coprocessor_fw_version,
        sizeof(uint16_t)
    );
    if (res != ESP_OK) {
        coprocessor_fw_version = 0;
        ESP_LOGW(TAG, "Failed to read from CH32V003 via I2C");
    }

    if (coprocessor_fw_version != target_coprocessor_fw_version) {
        ESP_LOGW(TAG, "Programming CH32V003 firmware, previous version was %u", coprocessor_fw_version);
        bsp_display_message("Please wait", "Updating coprocessor firmware...\n\nDo NOT power off the device");
        vTaskDelay(1000 / portTICK_PERIOD_MS);
        esp_err_t ch32_result = flash_coprocessor();

        if (ch32_result != ESP_OK) {
            ESP_LOGE(TAG, "Failed to program the CH32V003 co-processor");
            return ESP_ERR_INVALID_STATE;
        } else {
            ESP_LOGW(TAG, "Succesfully programmed the CH32V003 co-processor");
        }

        res = i2c_read_reg(
            I2C_BUS,
            COPROCESSOR_ADDR,
            COPROCESSOR_REG_FW_VERSION,
            (uint8_t*)&coprocessor_fw_version,
            sizeof(uint16_t)
        );
        if (res != ESP_OK || coprocessor_fw_version == 0) {
            ESP_LOGE(TAG, "Failed to read from CH32V003 via I2C after flashing");
            return ESP_ERR_INVALID_RESPONSE;
        }

        if (coprocessor_fw_version != target_coprocessor_fw_version) {
            ESP_LOGE(TAG, "CH32V003 reports invalid version %u via I2C after flashing", coprocessor_fw_version);
            invalid_version = true;
        }
    }

    ESP_LOGW(TAG, "CH32V003 firmware version %u", coprocessor_fw_version);

    // Initialize interrupt handling

    coprocessor_button_queue = xQueueCreate(8, sizeof(coprocessor_input_message_t));
    if (coprocessor_button_queue == NULL) {
        return ESP_ERR_NO_MEM;
    }

    coprocessor_intr_trigger = xSemaphoreCreateBinary();
    if (coprocessor_intr_trigger == NULL) {
        return ESP_ERR_NO_MEM;
    }

    coprocessor_semaphore = xSemaphoreCreateBinary();
    if (coprocessor_semaphore == NULL) {
        return ESP_ERR_NO_MEM;
    }

