badgeteam/hackerhotel-2024-firmware-esp32c6/components/hackerhotel2024-bsp/bsp.c
    res = gpio_isr_handler_add(GPIO_CH32_INT, coprocessor_intr_handler, NULL);
    if (res != ESP_OK)
        return res;

    gpio_config_t sao_cfg = {
        .pin_bit_mask = BIT64(GPIO_CH32_INT),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = false,
        .pull_down_en = false,
        .intr_type    = GPIO_INTR_NEGEDGE,
    };
    res = gpio_config(&sao_cfg);
    if (res != ESP_OK) {
        return res;
    }

    xTaskCreate(&coprocessor_intr_task, "Coprocessor interrupt", 4096, NULL, 10, &coprocessor_intr_task_handle);
    xSemaphoreGive(coprocessor_intr_trigger);

    xSemaphoreGive(coprocessor_semaphore);

    if (invalid_version) {
        return ESP_ERR_INVALID_VERSION;
    }

    return ESP_OK;
}

static esp_err_t initialize_sdcard() {
    sdmmc_host_t          host        = SDSPI_HOST_DEFAULT();
    sdspi_device_config_t slot_config = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot_config.gpio_cs               = GPIO_SDCARD_CS;
    slot_config.host_id               = SPI2_HOST;

    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files              = 5,
        .allocation_unit_size   = 16 * 1024
    };

    esp_err_t res = esp_vfs_fat_sdspi_mount("/sdcard", &host, &slot_config, &mount_config, &card);
    if (res != ESP_OK) {
        ESP_LOGW(TAG, "Initializing SD card failed");
        card = NULL;
    } else {
        sdmmc_card_print_info(stdout, card);
    }

    return ESP_OK;
}

esp_err_t bsp_init() {
    if (bsp_ready) {
        return ESP_OK;
    }

    esp_err_t res;

    // Addressable LED
    res = initialize_led();
    if (res != ESP_OK) {
        bsp_display_error("Initializing LED failed");
        return res;
    }

    bsp_set_addressable_led(0xFF0000);  // RED

    // Non volatile storage
    res = initialize_nvs();
    if (res != ESP_OK) {
        bsp_display_error("Initializing NVS failed");
        return res;
    }

    // GPIO
    res = initialize_gpio();
    if (res != ESP_OK) {
        bsp_display_error("Initializing GPIO failed");
        return res;
    }

    // E-paper lookup table
    res = initialize_epaper_lut();
    if (res != ESP_OK) {
        bsp_display_error("Initializing epaper LUT failed");
        return res;
    }

    // SPI bus
    res = initialize_spi_bus();
    if (res != ESP_OK) {
        bsp_display_error("Initializing SPI failed");
        return res;
    }

    // Epaper display
    res = initialize_epaper();
    if (res != ESP_OK) {
        bsp_display_error("Initializing epaper display failed");
        return res;
    }

    // Graphics stack
    res = initialize_graphics();
    if (res != ESP_OK) {
        bsp_display_error("Initializing graphics stack failed");
        return res;
    }

    bsp_set_addressable_led(0x0000FF);  // BLUE

    // Signal that epaper display is ready to be used
    epaper_ready = true;

    // I2C bus
    res = initialize_i2c_bus();
    if (res != ESP_OK) {
        bsp_display_error("Initializing I2C bus failed");
        return res;
    }

    // CH32V003 coprocessor
    res = initialize_coprocessor();
    if (res == ESP_ERR_INVALID_STATE) {
        bsp_display_error("Flashing CH32V003 failed\nPlease contact support");
        return res;
    } else if (res == ESP_ERR_INVALID_RESPONSE) {
        bsp_display_error(
            "No response from coprocessor\nRemove all addons and restart\nIf that doesn't help\nplease contact support"
        );
        return res;
    } else if (res == ESP_ERR_INVALID_VERSION) {
        bsp_display_error(
            "Coprocessor reports invalid\nversion. Please contact support\nBadge will attempt to continue starting"
        );
        vTaskDelay(2000 / portTICK_PERIOD_MS);
    } else if (res != ESP_OK) {
        bsp_display_error("Initializing coprocessor failed\n\nPlease contact support");
        return res;
    }

    // Signal that ch32v003 coprocessor is ready to be used
    ch32v003_ready = true;

    bsp_set_addressable_led(0x00FF00);  // GREEN

    // SD card
    res = initialize_sdcard();
    if (res != ESP_OK) {
        bsp_display_error("Initializing SD card failed");
        return res;
    }

    bsp_set_addressable_led(0x000000);  // OFF

    // Signal that all hardware is ready to be used
    bsp_ready = true;

    // Factory test
    if (!bsp_passed_factory_test()) {
        return bsp_factory_test();
    }

    return ESP_OK;
}

hink_t* bsp_get_epaper() {
    if (!epaper_ready)
        return NULL;
    return &epaper;
}

esp_err_t bsp_display_flush() {
    if (!epaper_ready)
        return ESP_FAIL;
    // if (!pax_is_dirty(&pax_buffer)) return ESP_OK;
    hink_write(&epaper, pax_buffer.buf);
    pax_mark_clean(&pax_buffer);
    return ESP_OK;
}

void bsp_display_wait() {
    if (!epaper_ready) {
        return;
    }
    while (hink_busy(&epaper)) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

bool bsp_display_busy() {
    if (!epaper_ready) {
        return true;
    }
    return hink_busy(&epaper);
}

pax_buf_t* bsp_get_gfx_buffer() {
    if (!bsp_ready)
        return NULL;
    return &pax_buffer;
}

QueueHandle_t bsp_get_button_queue() {
    return coprocessor_button_queue;
}

esp_err_t bsp_set_leds(uint32_t led) {
    if (xSemaphoreTake(coprocessor_semaphore, portMAX_DELAY)) {
        esp_err_t res =
            i2c_write_reg_n(I2C_BUS, COPROCESSOR_ADDR, COPROCESSOR_REG_LED, (uint8_t*)&led, sizeof(uint32_t));
        xSemaphoreGive(coprocessor_semaphore);
        return res;
    }
    return ESP_FAIL;
}

void bsp_restart() {
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    fflush(stdout);
    esp_restart();
}

esp_err_t bsp_apply_lut(epaper_lut_t lut_type) {
    return hink_apply_lut(&epaper, lut_type);
}

bool bsp_wait_for_button() {
    QueueHandle_t               queue         = bsp_get_button_queue();
    coprocessor_input_message_t buttonMessage = {0};
    bool                        result        = false;
    while (1) {
        if (xQueueReceive(queue, &buttonMessage, portMAX_DELAY) == pdTRUE) {
            if (buttonMessage.state == SWITCH_PRESS) {
                if (buttonMessage.button == SWITCH_5) {
                    result = true;
                }
                break;
            }
        }
    }
    return result;
}

uint8_t bsp_wait_for_button_number() {
    QueueHandle_t               queue         = bsp_get_button_queue();
    coprocessor_input_message_t buttonMessage = {0};
    while (1) {
        if (xQueueReceive(queue, &buttonMessage, portMAX_DELAY) == pdTRUE) {
            if (buttonMessage.state == SWITCH_PRESS) {
                return buttonMessage.button;
            }
        }
    }
}

