badgeteam/hackerhotel-2024-firmware-esp32c6/components/hackerhotel2024-bsp/bsp.c
void bsp_flush_button_queue() {
    QueueHandle_t               queue         = bsp_get_button_queue();
    coprocessor_input_message_t buttonMessage = {0};
    while (xQueueReceive(queue, &buttonMessage, 0) == pdTRUE) {
        // empty.
    }
}

esp_err_t bsp_set_addressable_led(uint32_t color) {
    uint8_t data[3];
    data[0] = (color >> 8) & 0xFF;   // R
    data[1] = (color >> 16) & 0xFF;  // G
    data[2] = (color >> 0) & 0xFF;   // B
    return ledstrip_send(&ledstrip, data, 3);
}

esp_err_t bsp_set_addressable_leds(const uint8_t* data, int length) {
    return ledstrip_send(&ledstrip, data, length);
}

bool bsp_passed_factory_test() {
    nvs_handle_t nvs_handle;
    esp_err_t    res = nvs_open("system", NVS_READWRITE, &nvs_handle);
    if (res != ESP_OK) {
        return false;
    }
    uint8_t value;
    res = nvs_get_u8(nvs_handle, "factory_test", &value);
    nvs_close(nvs_handle);
    if (res != ESP_OK) {
        return false;
    }

    return (value == 1);
}

esp_err_t bsp_factory_test() {
    esp_err_t res;

    if (!bsp_ready) {
        return ESP_FAIL;
    }

    bsp_display_message("Factory test", "Testing...");

    bsp_set_addressable_led(0xFF00FF);  // Purple

    bsp_set_relay(true);
    vTaskDelay(pdMS_TO_TICKS(500));
    bsp_set_relay(false);

    uint8_t buttons[5];
    xSemaphoreTake(coprocessor_semaphore, portMAX_DELAY);
    res = i2c_read_reg(I2C_BUS, COPROCESSOR_ADDR, COPROCESSOR_REG_BTN, buttons, 5);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "Factory test failed to read button states");
        bsp_display_message("Factory test", "Failed to read button states");
        xSemaphoreGive(coprocessor_semaphore);
        return ESP_FAIL;
    }
    xSemaphoreGive(coprocessor_semaphore);

    for (uint8_t index = 0; index < sizeof(buttons); index++) {
        if (buttons[index] != SWITCH_IDLE) {
            char message[40] = {0};
            snprintf(message, 39, " --- FAILED ---\nButton %u stuck (%u)", index + 1, buttons[index]);
            bsp_display_message("Factory test", message);
            return ESP_FAIL;
        }
    }

    bool  charging = bsp_battery_charging();
    float voltage  = bsp_battery_voltage();

    if (charging) {
        bsp_set_addressable_led(0xFF0000);  // Red
        char message[128];
        snprintf(
            message,
            sizeof(message) - 1,
            " --- FAILED ---\nBattery chip indicates charging\nwithout battery connected\nVoltage: %.2fv\n\nIGNORE? "
            "Press button 3",
            voltage
        );
        bsp_display_message("Factory test", message);
        uint8_t button = 0;
        while (button != SWITCH_3) {
            button = bsp_wait_for_button_number();
        }
    }

    if (voltage >= 4.3) {
        bsp_set_addressable_led(0xFF0000);  // Red
        char message[128];
        snprintf(
            message,
            sizeof(message) - 1,
            " --- FAILED ---\nBattery terminal voltage too high\nVoltage: %.2fv\n\nIGNORE? Press button 4",
            voltage
        );
        bsp_display_message("Factory test", message);
        uint8_t button = 0;
        while (button != SWITCH_4) {
            button = bsp_wait_for_button_number();
        }
    }

    bsp_set_leds(0xFFFFFFFF);

    bsp_display_message(
        "Factory test",
        "Check LEDs:\nAll diamond LEDs should be on\nAddressable LED should be pink\n\nOK?   Press button 5\nFAIL? "
        "Press button 1\nSKIP? Press button 2"
    );

    bsp_flush_button_queue();
    uint8_t button = bsp_wait_for_button_number();

    bool pass = (button == SWITCH_5);

    if (button == SWITCH_2) {
        bsp_display_message("Factory test", " --- SKIPPED ---\nStarting application...");
        return ESP_OK;
    }

    if (!pass) {
        bsp_set_addressable_led(0xFF0000);  // Red
        bsp_display_message("Factory test", " --- FAILED ---\nLEDs not okay");
        return ESP_FAIL;
    }

    bsp_display_message("Factory test", " --- PASS ---");

    nvs_handle_t nvs_handle;
    res = nvs_open("system", NVS_READWRITE, &nvs_handle);
    if (res != ESP_OK) {
        bsp_set_addressable_led(0xFF0000);  // Red
        bsp_display_message("Factory test", " --- FAILED ---\nNVS open failed");
        return ESP_FAIL;
    }
    res = nvs_set_u8(nvs_handle, "factory_test", 1);
    nvs_commit(nvs_handle);
    nvs_close(nvs_handle);
    if (res != ESP_OK) {
        bsp_set_addressable_led(0xFF0000);  // Red
        bsp_display_message("Factory test", " --- FAILED ---\nNVS store failed");
        return ESP_FAIL;
    }

    pax_background(&pax_buffer, WHITE);
    pax_insert_png_buf(&pax_buffer, hackerhotel_png_start, hackerhotel_png_end - hackerhotel_png_start, 0, 0, 0);
    const esp_app_desc_t* app_description = esp_app_get_description();
    pax_draw_text(&pax_buffer, RED, pax_font_sky_mono, 9, 0, 0, app_description->version);
    bsp_apply_lut(lut_full);
    bsp_display_flush();
    bsp_display_wait();

    bsp_set_addressable_led(0x00FF00);  // Green

    // Wait until power gets removed
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(100));
    }

    return ESP_OK;
}

esp_err_t bsp_set_relay(bool state) {
    return gpio_set_level(GPIO_RELAY, state);
}

float bsp_battery_voltage() {
    int       adc_raw = 0;
    esp_err_t res     = adc_oneshot_read(adc_vbatt_handle, ADC_VBATT, &adc_raw);
    if (res != ESP_OK) {
        return 0;
    }

    return (adc_raw * 8.3) / 4095.0;
}

bool bsp_battery_charging() {
    return !gpio_get_level(GPIO_BATT_CHRG);
}

esp_err_t bsp_sao_addressable_led_enable() {
    return ledstrip_init(&sao_ledstrip);
}

esp_err_t bsp_sao_addressable_led_disable() {
    return ledstrip_deinit(&sao_ledstrip);
}

esp_err_t bsp_sao_addressable_led_set(const uint8_t* data, int length) {
    return ledstrip_send(&sao_ledstrip, data, length);
}
